# Taps
tap 'homebrew/cask'

# tap 'homebrew/cask-fonts'  # open-source/free fonts
tap 'homebrew/bundle'        # Bundler for non-Ruby dependencies from Homebrew, Homebrew Cask, Mac App Store and Whalebrew.

# Binaries
brew 'awscli'                # Amazon Web Services command line
# brew 'bash'                  # Latest Bash version
# brew 'bat'                   # "cat" on steroids
# brew 'coreutils'             # Those that come with macOS are outdated
# brew 'ffmpeg'                # Mpeg encoder
# brew 'gh'                    # Github command line
# brew 'git'
# brew 'gnupg2'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas'                     # A simple command line interface for the Mac App Store. Designed for scripting and automation.
brew 'pkg-config'              # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe'
# brew 'svn'
# brew 'trash' # Manage the Trash bin
brew 'tree'                  # List directories in a tree structure; http://mama.indstate.edu/users/ice/tree/
# brew 'zlib' # Needed for Memcached

# Development
# brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
# brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'

# Apps
cask '1password'
#cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
#cask 'aerial'
#cask 'alfred'
cask 'appcleaner'
#cask 'bartender'
cask 'bbedit'
#cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'chronosync'
cask 'cleanmymac'
#cask 'dbngin'
#cask 'discord'
#cask 'docker'
cask 'dropbox'
cask 'dupeguru'
cask 'evernote'

#cask 'figma'
cask 'fantastical'
cask 'firefox'
#cask 'github'
#cask 'google-backup-and-sync'
#cask 'google-chrome'
#cask 'gpg-suite'
#cask 'imageoptim'
#cask 'insomnia'
#cask 'java'
cask 'jump'
cask 'microsoft-edge'
#cask 'mysqlworkbench'
#cask 'nvidia-geforce-now'
cask 'parallels-desktop'
cask 'parallels-access'

#cask 'phpstorm'
cask 'pycharm'
cask 'pycharm-ce'
cask 'sourcetree'
#cask 'screenflow'
#cask 'skype'
#cask 'slack'
#cask 'steam'
#cask 'sublime-text'
#cask 'tableplus'
#cask 'telegram-desktop'
#cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'tor-browser'
#cask 'transmission'
#cask 'transmit'
#cask 'vagrant'
#cask 'virtualbox' # Might need to allow access in Security settings
#cask 'virtualbox-extension-pack'
#cask 'visual-studio-code'
cask 'vlc'
#cask 'whatsapp'
cask 'zoomus'

## Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'
#
# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
